Configuración del lado izquierdo de la topología
Se configura el VTP en modo cliente para los switches s2, s3
S2  
Switch>ENA
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname s2
s2(config)#vtp mode client
Setting device to VTP Client mode for VLANS.
s2(config)#vtp domain tomas-01
Changing VTP domain name from NULL to tomas-01
s2(config)#vtp
*Sep 20 04:36:16.651: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to tomas-01.
% Incomplete command.
s2(config)#vtp password tomas
Setting device VTP password to tomas
s2(config)#
 
 s3 
Switch>ena
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname s3
s3(config)#vtp mode client
Setting device to VTP Client mode for VLANS.
s3(config)#vtp domain tomas-01
Changing VTP domain name from NULL to tomas-01
s3(config)#
*Sep 20 04:38:16.197: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to tomas-01.
s3(config)#vtp password tomas
Setting device VTP password to tomas
s3(config)#exit

configuramos el switch s2 con VTP modo server
s2 
 
Switch>ena
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname s1
s1(config)#vtp mode server
Device mode already VTP Server for VLANS.
s1(config)#vtp domain tomas-01
Changing VTP domain name from NULL to tomas-01
s1(config)#
*Sep 20 04:39:21.835: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to tomas-01.
s1(config)#vtp password tomas
Setting device VTP password to tomas
 

Truncamos las interfaces de los switches
S1
s1#ena
s1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
s1(config)#inter g0/1
s1(config-if)#switchport trunk encapsulation dot1q
s1(config-if)#switchport mode trunk
s1(config-if)#switchport trunk native vlan 99
s1(config-if)#end
s1#
 
 
s1#ena
s1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
s1(config)#inter g0/0
s1(config-if)#switchport trunk encapsulation dot1q
s1(config-if)#switchport mode trunk
s1(config-if)#switchport trunk native vlan 99
s1(config-if)#end
 
s1>ena
s1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
s1(config)#inter g0/2
s1(config-if)#switchport trunk encapsulation dot1q
s1(config-if)#switchport mode trunk
s1(config-if)#switchport trunk native vlan 99
s1(config-if)#exit
s1(config)#end
s1#
 
 
 S2
 
s2#ena
s2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
s2(config)#inter g0/1
s2(config-if)#switchport
*Sep 20 04:45:37.393: %CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on GigabitEthernet0/1 (1), with s1 GigabitEthernet0/1 (99).
s2(config-if)#switchport trunk encapsulation dot1q
s2(config-if)#switchport mode trunk
s2(config-if)#switchport trunk native vlan 99
s2(config-if)#end
 
  
s2#ena
s2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
s2(config)#inter g0/0
s2(config-if)#switchport trunk encapsulation dot1q
s2(config-if)#switchport mode trunk
s2(config-if)#switchport trunk native vlan 99
s2(config-if)#end
s2#
 
 S3 

s3>ena
s3#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
s3(config)#inter g0/1
s3(config-if)#switchport trunk encapsulation dot1q
s3(config-if)#switchport mode trunk
s3(config-if)#switchport trunk native vlan 99
s3(config-if)#end
 
 
 
s3#ena
s3#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
s3(config)#inter g0/0
s3(config-if)#switchport trunk encapsulation dot1q
s3(config-if)#switchport mode trunk
s3(config-if)#switchport trunk native vlan 99
s3(config-if)#end
s3#
 
Creamos las vlans en el switch s1 que VTP SERVER
S1 
s1#ena
s1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
s1(config)#vlan 10
s1(config-vlan)#name vlan10
s1(config-vlan)#exit
s1(config)#vlan 20
s1(config-vlan)#name vlan20
s1(config-vlan)#exit
s1(config)#end
 



Creamos las subredes en el router r1 ingresándole su defaul Gateway

R1
R1#ena
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#inter fa1/0
R1(config-if)#no ip add
R1(config-if)#no sh
R1(config-if)#
R1(config)#inter fa1/0
R1(config-if)#inter fa1/0.10
R1(config-subif)#encapsulation dot1q 10
R1(config-subif)#ip address 192.168.10.1 255.255.255.0
R1(config-subif)#exit
R1(config)#inter fa1/0
R1(config-if)#inter fa1/0.20
R1(config-subif)#encapsulation dot1q 20
R1(config-subif)#ip address 192.168.20.1 255.255.255.0
R1(config-subif)#exit
R1(config)#

Asignamos las VLANS a sus puertos correspondientes
S2 

Inter g0/0
s2>ena
s2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
s2(config)#inter g0/0
s2(config-if)#switchport mode access
s2(config-if)#switchport access vlan 10
s2(config-if)#exit
s2(config)#end
s2#
 
Inter g0/2
s2#ena
s2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
s2(config)#inter g0/2
s2(config-if)#switchport mode access
s2(config-if)#switchport access vlan 20
s2(config-if)#exit
s2(config)#end
 
S3 
 
Inter g0/0
s3>ena
s3#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
s3(config)#inter g0/0
s3(config-if)#switchport mode access
s3(config-if)#switchport access vlan 20
s3(config-if)#exit
s3(config)#end
 
Inter g0/2
s3#ena
s3#conf t
s3(config)#inter g0/2
s3(config-if)#switchport mode access
s3(config-if)#switchport access vlan 10
s3(config-if)#exit
s3(config)#end
 




Por último, agregamos ips al pc y hacemos ping para ver la conexión 
Los siguientes comandos son para agregar ip y hacer ping.
Únicamente coloque evidencias de la pc2 pero todas conectaron a la perfección. 
 
 
PC2> 2                                                                          Only 1 VPCs actived
 
PC2> ip 192.168.20.100 gateway 192.168.20.1
Checking for duplicate address...
PC1 : 192.168.20.100 255.255.255.0 gateway 192.168.20.1
 
 
PING 
La ip es de otra PC que está conectada a una interfaz que pertenece a la misma VLAN 
 
PC2> ping 192.168.20.101
84 bytes from 192.168.20.101 icmp_seq=1 ttl=64 time=32.817 ms
84 bytes from 192.168.20.101 icmp_seq=2 ttl=64 time=36.362 ms
84 bytes from 192.168.20.101 icmp_seq=3 ttl=64 time=29.783 ms
84 bytes from 192.168.20.101 icmp_seq=4 ttl=64 time=19.369 ms
84 bytes from 192.168.20.101 icmp_seq=5 ttl=64 time=39.168 ms
 
 
********************************************************************************************************************


Configuración del lado derecho de la topología

Configuramos los switches s5 y s6 con VTP clientes
La configuración siguiente aplica para los dos switches
Switch>ena
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname s5
s5(config)#vtp mode client
Setting device to VTP Client mode for VLANS.
s5(config)#vtp domain tomas-02
Changing VTP domain name from NULL to tomas-02
s5(config)#vt
*Sep 20 06:26:07.747: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to tomas-02.
% Ambiguous command:  "vt"
s5(config)#vtp password tomas
Setting device VTP password to tomas
s5(config)#exit
s5#


configuramos el switch s4 con VTP SERVER

Switch>ena
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname s4
s4(config)#vtp mode server
Device mode already VTP Server for VLANS.
s4(config)#vtp domain tomas-02
Changing VTP domain name from NULL to tomas-02
s4(config)#
*Sep 20 06:30:13.877: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to tomas-02.
s4(config)#vtp password tomas
Setting device VTP password to tomas
s4(config)#exit



Truncamos las interfaces de todos los switches
Repetimos estos mismos comandos lo que cambiaría son las interfaces
S6 
s6(config)#inter range g0/0-1
s6(config-if-range)#switchport trunk encapsulation dot1q
s6(config-if-range)#switchport mode trunk
s6(config-if-range)#switchport trunk native vlan 99
s6(config-if-range)#end



  
Creamos las sub-redes en el router r2
 
R2#ena
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#inter fa1/0
R2(config-if)#no ip add
R2(config-if)#no sh
R2(config-if)#
*Mar  1 01:45:27.340: %LINK-3-UPDOWN: Interface FastEthernet1/0, changed state to up
*Mar  1 01:45:28.341: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/0, changed state to up
R2(config-if)#exit
R2(config)#inter fa1/0
R2(config-if)#inter fa1/0.30
R2(config-subif)#encapsulation dot1q 30
R2(config-subif)#ip address 192.168.30.1 255.255.255.0
R2(config-subif)#exit
R2(config)#inter fa1/0
R2(config-if)#inter fa1/0.40
R2(config-subif)#encapsulation dot1q 40
R2(config-subif)#ip address 192.168.40.1 255.255.255.0
R2(config-subif)#exit
 
 


Asignamos las VLANS  a sus puertos correspondientes
 
s5>ena
s5#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
s5(config)#inter g0/0
s5(config-if)#switchport mode access
s5(config-if)#switchport access vlan 30
s5(config-if)#exit
s5(config)#inter g0/2
s5(config-if)#switchport mode access
s5(config-if)#switchport access vlan 40
s5(config-if)#exit
s5(config)#
 
 
s6>ena
s6#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
s6(config)#inter g0/0
s6(config-if)#switchport mode access
s6(config-if)#switchport access vlan 40
s6(config-if)#exit
s6(config)#inter g0/2
s6(config-if)#switchport mode access
s6(config-if)#switchport access vlan 30
s6(config-if)#exit
s6(config)#
 

  
Por último agregamos una ip a cada pc y hacemos una prueba generando un ping
 
Agregamos una ip al pc 
 pc7 
PC7> 2
Only 1 VPCs actived
 
PC7> ip 192.168.40.101/24 gateway 192.168.40.1
Checking for duplicate address...
PC1 : 192.168.40.101 255.255.255.0 gateway 192.168.40.1
 
Pc4
 
PC4> 2
Only 1 VPCs actived
 
PC4> ip 192.168.40.100/24 gateway 192.168.40.1
Checking for duplicate address...
PC1 : 192.168.40.100 255.255.255.0 gateway 192.168.40.1
 
 
Aquí podemos ver como la pc4 le hace ping al pc 7 ya que es su misma vlan
 
 
PC4> ping 192.168.40.101
84 bytes from 192.168.40.101 icmp_seq=1 ttl=64 time=57.553 ms
84 bytes from 192.168.40.101 icmp_seq=2 ttl=64 time=59.100 ms
84 bytes from 192.168.40.101 icmp_seq=3 ttl=64 time=60.594 ms
84 bytes from 192.168.40.101 icmp_seq=4 ttl=64 time=60.105 ms
84 bytes from 192.168.40.101 icmp_seq=5 ttl=64 time=42.027 ms
 
PC4> ping 192.168.40.1
84 bytes from 192.168.40.1 icmp_seq=1 ttl=255 time=62.742 ms
84 bytes from 192.168.40.1 icmp_seq=2 ttl=255 time=31.277 ms
84 bytes from 192.168.40.1 icmp_seq=3 ttl=255 time=35.771 ms
84 bytes from 192.168.40.1 icmp_seq=4 ttl=255 time=26.951 ms
84 bytes from 192.168.40.1 icmp_seq=5 ttl=255 time=29.155 ms
 
 



